Ejercicio 1.  ¿Qué BBDD tenemos en nuestro servidor?

In [2]:
import mysql.connector

In [2]:
cnx = mysql.connector.connect(user = "root", password = "AlumnaAdalab", 
                            host = "127.0.0.1", 
                            database = "tienda")

cursor = cnx.cursor()
cursor.execute("SHOW DATABASES")

In [3]:
for x in cursor:
    print(x)

('information_schema',)
('leccion-1-sql',)
('leccion-10-sql',)
('leccion-11-sql',)
('leccion-12-sql',)
('leccion-13-sql',)
('leccion-14-sql',)
('leccion-2-sql',)
('leccion-3-sql',)
('leccion-4-sql',)
('leccion-5-sql',)
('leccion-6-sql',)
('leccion-7-sql',)
('leccion-8-sql',)
('leccion-9-sql',)
('mysql',)
('new_schema_pruebas',)
('northwind',)
('performance_schema',)
('proyecto_1_team_1',)
('sakila',)
('sys',)
('tienda',)
('tienda_zapatillas',)
('world',)

In [4]:
cnx.close()
cursor.close()

True

Ejercicio 2.  Empezemos a explorar la BBDD de Northwind. ¿Qué tablas componen la BBDD? Guarda el resultado de los nombres de la tablas en una lista.

In [22]:
cnx = mysql.connector.connect(user = "root", password = "AlumnaAdalab", 
                            host = "127.0.0.1", 
                            database = "northwind")

cursor = cnx.cursor()
cursor.execute("SHOW TABLES")

resultados_tablas_north = cursor.fetchall()

print(resultados_tablas_north)

cursor.close()
cnx.close()

[('categories',), ('customer_customer_demo',), ('customer_demographics',), ('customers',), ('empleadas',), ('employee_territories',), ('employees',), ('order_details',), ('orders',), ('products',), ('region',), ('shippers',), ('suppliers',), ('territories',)]

Ejercicio 3. ¿Qué columnas tiene cada una de las tablas?

In [5]:
cnx = mysql.connector.connect(user = "root", password = "AlumnaAdalab", 
                            host = "127.0.0.1", 
                            database = "INFORMATION_SCHEMA")

cursor = cnx.cursor()


cursor.execute("""SELECT TABLE_NAME, COLUMN_NAME FROM COLUMNS WHERE TABLE_SCHEMA = 'northwind'""")

for a in cursor:
  print(a)
  break 

#El brake lo hemos puesto de cara a no "ensuciar" mucho el archivo.

('categories', 'category_id')

In [34]:
cnx.close()
cursor.close()

True

Ejercicio 4. Hagamos unas queries facilitas

        consulta1:Extraed el primer pedido donde se ha gastado más

        consulta 2:Devuelve la misma query que en el anterior ejercicio, pero en este caso devuelve todos los resultados

        consulta 3:Extraed el números de pedidos que se hayan hecho por dia. Devuelve los resultados en una dataframe

        consulta 4:Extraer los pedidos hechos por "Nancy Daviolo"

In [7]:
import pandas

In [8]:
cnx = mysql.connector.connect(user = "root", password = "AlumnaAdalab", 
                            host = "127.0.0.1", 
                            database = "northwind")

cursor = cnx.cursor()

consulta1 = ("""SELECT order_id, (unit_price * quantity) As Total
                FROM order_details 
                ORDER BY (unit_price * quantity) DESC LIMIT 1; """)

cursor.execute(consulta1)

consulta1_resultado = cursor.fetchall()

In [9]:
print(f"El orderID más caro ha sido {consulta1_resultado[0][0]} y su coste total ha sido {consulta1_resultado[0][1]}")

El orderID más caro ha sido 10865 y su coste total ha sido 15810.0

In [10]:
consulta2 = ("""SELECT order_id, (unit_price * quantity) As Total
                FROM order_details 
                ORDER BY (unit_price * quantity) DESC; """)

cursor.execute(consulta2)
consulta2_resultado = cursor.fetchall()

In [ ]:
print(consulta2_resultado) #no lo dejamos ejecutado por no "ensuciar" mucho el aarchivo nuevamente

In [12]:
consulta3 = ("""SELECT COUNT(order_id), order_date
                FROM orders
                GROUP BY DAY(order_date);""")

cursor.execute(consulta3)
consulta3_resultado = cursor.fetchall()

consulta3_dataframe = pandas.DataFrame(consulta3_resultado, columns = ['Order_ID', 'OrderDate'])

In [13]:
consulta3_dataframe

    Order_ID  OrderDate
0         27 1996-07-04
1         31 1996-07-05
2         21 1996-07-08
3         31 1996-07-09
4         28 1996-07-10
5         27 1996-07-11
6         28 1996-07-12
7         22 1996-07-15
8         32 1996-07-16
9         29 1996-07-17
10        26 1996-07-18
11        29 1996-07-19
12        26 1996-07-22
13        30 1996-07-23
14        30 1996-07-24
15        26 1996-07-25
16        30 1996-07-26
17        23 1996-07-29
18        29 1996-07-30
19        14 1996-07-31
20        26 1996-08-01
21        27 1996-08-02
22        33 1996-08-06
23        22 1996-08-07
24        25 1996-08-13
25        25 1996-08-14
26        27 1996-08-20
27        22 1996-08-21
28        32 1996-08-27
29        22 1996-08-28
30        30 1996-09-03

In [14]:
consulta4 = ("""SELECT *
                FROM orders
                WHERE employee_id IN (SELECT employee_id
                                      FROM employees
                                      WHERE last_name = 'Davolio')""")

cursor.execute(consulta4)
consulta4_resultado = cursor.fetchall()

In [ ]:
print(consulta4_resultado) #No lo hemos impreso porque en Pandas es más legible, pero funciona

In [16]:
consulta4_dataframe = pandas.DataFrame(consulta4_resultado, columns = ['OrderID', 'CustomerID', 'EmployeeID', 'OrderDate',' RequiredDate', 'ShippedDate', 'ShipVia', 'Peso', 'ShipName', 'ShipAddres', 'ShipCity', 'ShipRegion', 'ShipPostalCode', 'ShipCountry'])

In [17]:
consulta4_dataframe

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Peso,ShipName,ShipAddres,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10258,ERNSH,1,1996-07-17,1996-08-14,1996-07-23,1,140.51,Ernst Handel,Kirchgasse 6,Graz,,8010,Austria
1,10270,WARTH,1,1996-08-01,1996-08-29,1996-08-02,1,136.54,Wartian Herkku,Torikatu 38,Oulu,,90110,Finland
2,10275,MAGAA,1,1996-08-07,1996-09-04,1996-08-09,1,26.93,Magazzini Alimentari Riuniti,Via Ludovico il Moro 22,Bergamo,,24100,Italy
3,10285,QUICK,1,1996-08-20,1996-09-17,1996-08-26,2,76.83,QUICK-Stop,Taucherstra�e 10,Cunewalde,,1307,Germany
4,10292,TRADH,1,1996-08-28,1996-09-25,1996-09-02,2,1.35,Tradi�ao Hipermercados,"Av. In�s de Castro, 414",Sao Paulo,SP,05634-030,Brazil
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
118,11064,SAVEA,1,1998-05-01,1998-05-29,1998-05-04,1,30.09,Save-a-lot Markets,187 Suffolk Ln.,Boise,ID,83720,USA
119,11067,DRACD,1,1998-05-04,1998-05-18,1998-05-06,2,7.98,Drachenblut Delikatessen,Walserweg 21,Aachen,,52066,Germany
120,11069,TORTU,1,1998-05-04,1998-06-01,1998-05-06,2,15.67,Tortuga Restaurante,Avda. Azteca 123,M�xico D.F.,,5033,Mexico
121,11071,LILAS,1,1998-05-05,1998-06-02,NaT,1,0.93,LILA-Supermercado,Carrera 52 con Ave. Bol�var #65-98 Llano Largo,Barquisimeto,Lara,3508,Venezuela
122,11077,RATTC,1,1998-05-06,1998-06-03,NaT,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA

Ejercicio 5. Desconectar la conexión con el servidor.

In [18]:
cnx.close()
cursor.close()

True